calsci-io/CalSci_firmware/ports/esp32/boards/ESP32_GENERIC_S3/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "Generic ESP32S3 module"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

// Use new I2C driver to avoid conflict with esp_driver_i2c in IDF v5.4
#define MICROPY_HW_ESP_NEW_I2C_DRIVER       (1)
